// for шаг.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include <iostream>
#include<math.h>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Rus");
    int i, sum=0;
    float a;
    cout << "Конвертатор валют\n";
    cout << "Щоб почати натиснiть будь-яку цифру крiм нуля(0 - вихiд):\n";
    cin >> i;
    for (; i!=0;)
    {
        cout << "*************************************************************************************************************************************************\n";
        cout << "*************************************************************************************************************************************************\n";
        cout << "** Гривнi у долари - 1 ** Гривнi у євро - 2 ** Долари у гривнi - 3 ** Долари у євро - 4 ** Євро у гривнi - 5 ** Євро у долари - 6 ** Вихiд - 0 **\n";
        cout << "*************************************************************************************************************************************************\n";
        cout << "*************************************************************************************************************************************************\n";
        cin >> i;
        if (i = 1)
        {
            cout << "Введiть суму для обмiну:\n";
            cin >> a;
            cout << "Гривнi>>долари = " << (a * 0.035) << " доларiв.\n";
        }
        else if (i = 2)
        {
            cout << "Введiть суму для обмiну:\n";
            cin >> a;
            cout << "Гривнi>>євро = " << (a * 0.031) << " євро.\n";
        }
        else if (i = 3)
        {
            cout << "Введiть суму для обмiну:\n";
            cin >> a;
            cout << "Долари>>гривнi = " << (a * 28.43) << " гривень.\n";
        }
        else if (i = 4)
        {
            cout << "Введiть суму для обмiну:\n";
            cin >> a;
            cout << "Долари>>євро = " << (a * 0.88) << " євро.\n";
        }
        else if (i = 5)
        {
            cout << "Введiть суму для обмiну:\n";
            cin >> a;
            cout << "Євро>>гривнi = " << (a * 32.26) << " гривень.\n";
        }
        else if (i = 6)
        {
            cout << "Введiть суму для обмiну:\n";
            cin >> a;
            cout << "Євро>>долари = " << (a * 1.12) << " гривень.\n";
        }
        cout << "Щоб продовжити конвертування валют натиснiть будь-яку цифру крiм нуля(0 - вихiд)\n";
        cin >> i;
    }
} 

